[Spark X2SoldierClassTemplate]
AbilityTreeTitles[0]="Dreadnaught"
AbilityTreeTitles[1]="Heavy Metal"
AbilityTreeTitles[2]="Future Combat"
AbilityTreeTitles[3]="War Machine"

[MasterBlaster X2AbilityTemplate]
LocFriendlyName="Master Blaster"
LocLongDescription="Gain the Salvo ability, allowing your grenades, rockets, heavy weapons, and Bombard ability to be used without ending the turn. The Bombard ability, if you have it, gains a bonus charge."
LocHelpText="Gain the Salvo ability and a bonus charge for the Bombard ability."
LocFlyOverText="Master Blaster"

[ManualOverride X2AbilityTemplate]
LocFriendlyName="Manual Override"
LocLongDescription="Lower all ability cooldowns by 1. Costs one action and does not end the turn."
LocHelpText="Lower all ability cooldowns by 1. Costs one action and does not end the turn."
LocPromotionPopupText="<Bullet/> Use the <Ability:ClassName/>'s abilities early and often to take full advantage of Manual Override.<br/>"

[KineticStrike X2AbilityTemplate]
LocFriendlyName="Strike"
LocLongDescription="Attack any enemy within movement range with a devastating punch. 2-turn cooldown. Damage is dependent on equipped chassis."
LocHelpText="Attack any enemy within movement range with a devastating punch."
LocPromotionPopupText="<Bullet/> You can trigger the Strike ability by placing the movement cursor over an enemy.<br/><Bullet/> A SPARK can perform a \"Dash\" move, using both actions to move, and still trigger a Strike against an adjacent enemy.<br/><Bullet/> Strike will do 8/10/12 damage, depending on the equipped SPARK chassis.<br/><Bullet/> Strike's chance to hit is based off the SPARK's aim with a +10 boost.<br/><Bullet/> Learning the Assault Servos ability will grant +2 damage and an extra +20 aim to all Strike attacks.<br/>"